src/DataProcessors/mega_OrderExchange/mega_OrderExchange.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>mega_OrderExchange</name>
</mdclass:DataProcessor>

src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШтрихкодыНоменклатуры</name>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/НоменклатураПоставщиков/НоменклатураПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НоменклатураПоставщиков</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>110</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Остаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокПополнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетПоУмолчанию</name>
    <comment>Банковский счет по умолчанию</comment>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаРасчетовПоУмолчанию</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиРасчетыПоДоговорам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиРасчетыПоДокументам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиРасчетыПоЗаказам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетОплатыПоСчетам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидГосударственногоОргана</name>
    <type>
      <types>EnumRef.ВидыГосударственныхОрганов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтрагента</name>
    <type>
      <types>EnumRef.ВидыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнойКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступаКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументУдостоверяющийЛичность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресЭПДляПоиска</name>
    <comment>Адрес ЭП для поиска при вводе по строке</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИННВведенКорректно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПривлеченияПокупателя</name>
    <type>
      <types>CatalogRef.ИсточникиПривлеченияПокупателей</types>
    </type>
  </attributes>
  <attributes>
    <name>КодГосударственногоОргана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицоПодписант</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КППВведенКорректно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефонаДляПоиска</name>
    <comment>Номер телефона для поиска при вводе по строке</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновныеСведения</name>
    <comment>Используется для поиска в списке</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрочиеОтношения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетыВУсловныхЕдиницахПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <comment>ОГРН для не иностранных контрагентов</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоСерияНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособЗачетаПредоплатыПоУмолчанию</name>
    <type>
      <types>EnumRef.СпособыЗачетаИРаспределенияПлатежей</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРазнесенияОплатыПоУмолчанию</name>
    <type>
      <types>EnumRef.СпособыЗачетаИРаспределенияПлатежей</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДСПоУмолчанию</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаАвансовПокупателя</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаАвансовПоставщику</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовСПокупателем</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовСПоставщиком</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьАдресЭП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДоговорПоУмолчанию</name>
    <comment>(не используется) Договор контрагента по умолчанию</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНомерТелефона</name>
    <comment>Номер телефона для поиска при вводе по строке</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИО</name>
    <comment>ФИО физ лица</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбратныйНомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Теги</name>
    <attributes>
      <name>Тег</name>
      <type>
        <types>CatalogRef.Теги</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияКПП</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияНаименований</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПолное</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/mega_OrderExchange/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ФункцияПреобразованияЗаписи(Свойство, Значение, ДополнительныеПараметры, Отказ) Экспорт
	Если ТипЗнч(Значение) = Тип("УникальныйИдентификатор") Тогда
		Возврат Строка(Значение);
	КонецЕсли;
	Отказ = Истина;
КонецФункции

Функция ПолучитьЗаказОптСтрокой(id)Экспорт 
	
	id = 	Лев(id, 8) + "-" + 
			Сред(id, 9, 4) + "-" + 
			Сред(id, 13, 4) + "-" + 
			Сред(id, 17, 4) + "-" + 
			Прав(id, 12);
	
	ИсходящаяСтруктура = Новый Структура;
	МассивЗаказов = Новый Массив;
	
	
	ЗаписьJSON 							= Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру 		= Истина;
	ПараметрыЗаписиJSON 				= Новый ПараметрыЗаписиJSON(, Символы.Таб);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	
	
	ЗаказПокупателя = ЗаказПокупателяПоИдентификатору(id);	
	ЗаказПокупателя = ЗаказПокупателя.ПолучитьОбъект();
	
	СписокФБО = СписокФБО();
	ФБО = МассивФБО(СписокФБО);
	
	Если (ЗаказПокупателя <> Неопределено) И 
			(ФБО.Найти(ЗаказПокупателя.Контрагент) <> Неопределено) Тогда 
		
				
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПокупателяТовары.НомерСтроки КАК НомерСтроки,
		|	ЗаказПокупателяТовары.Номенклатура.Наименование КАК Наименование,
		|	ЗаказПокупателяТовары.Номенклатура КАК Номенклатура,
		|	ЗаказПокупателяТовары.Номенклатура.Штрихкод КАК Штрихкод,
		|	ЗаказПокупателяТовары.Номенклатура.Код КАК Код,
		|	ЗаказПокупателяТовары.Номенклатура.Артикул КАК Артикул,
		|	ЗаказПокупателяТовары.Количество КАК Количество,
		|	ЗаказПокупателяТовары.mega_НомерЗаказа КАК НомерДокумента,
		|	ЗаказПокупателяТовары.mega_НоменклатураПокупателя КАК НоменклатураПокупателя,
		|	ЗаказПокупателяТовары.mega_НоменклатураПокупателя.Код КАК НоменклатураПокупателяКод,
		|	ЗаказПокупателяТовары.mega_НоменклатураПокупателя.Наименование КАК НоменклатураПокупателяНаименование,
		|	ЗаказПокупателяТовары.mega_НоменклатураПокупателя.Артикул КАК НоменклатураПокупателяАртикул,
		|	ЗаказПокупателяТовары.mega_НоменклатураПокупателя.Идентификатор КАК НоменклатураПокупателяИдентификатор
		|ИЗ
		|	Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяТовары
		|ГДЕ
		|	ЗаказПокупателяТовары.Ссылка = &ЗаказПокупателя
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя.Ссылка);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		
		
		Покупатель = ПолучитьПокупателя(ЗаказПокупателя.Контрагент);
		ИсходящаяСтруктура.Вставить("head", Новый Структура("id,number,date,type,customer", 
										Строка(ЗаказПокупателя.Ссылка.УникальныйИдентификатор()), 
										ЗаказПокупателя.Номер, 
										Формат(ЗаказПокупателя.Дата, "ДФ=yyyyMMddHHmmss"),
										СписокФБО.Получить(ЗаказПокупателя.Контрагент),
										Покупатель));		 

		Пока Выборка.Следующий() Цикл
			
			Если Не ЗначениеЗаполнено(Выборка.Номенклатура) Тогда 
				
				Продолжить;
			КонецЕсли;
			
			Структура = Новый Структура;
			Структура.Вставить("index", 	Выборка.НомерСтроки);
			Структура.Вставить("name", 		СокрЛП(Лев(Выборка.Наименование, 150)));
			Структура.Вставить("id", 		Строка(Выборка.Номенклатура.УникальныйИдентификатор()));
			Структура.Вставить("code", 		СокрЛП(Выборка.Код));
			Структура.Вставить("art", 		СокрЛП(Выборка.Артикул));
			Структура.Вставить("qnt", 		Строка(Выборка.Количество));
			Структура.Вставить("number", 	СокрЛП(Выборка.НомерДокумента));
			Структура.Вставить("barcode", 	Выборка.Штрихкод);						                            			
			
//			НоменклатураПокупателя = ПолучитьНоменклатуруПокупателя(ЗаказПокупателя.Контрагент, Выборка.Номенклатура);
//			Если НоменклатураПокупателя <> Неопределено Тогда 
//				
//				Структура.Вставить("name", 		СокрЛП(Лев(НоменклатураПокупателя.Наименование, 150)));
//				Структура.Вставить("code", 		НоменклатураПокупателя.Код);
//				Структура.Вставить("art", 		НоменклатураПокупателя.Артикул);
//				Структура.Вставить("barcode", 	НоменклатураПокупателя.Идентификатор);
//			КонецЕсли;

			Если ЗначениеЗаполнено(Выборка.НоменклатураПокупателя) Тогда
				
				НоменклатураПокупателя = Новый Структура;
				НоменклатураПокупателя.Вставить("id", Строка(Выборка.НоменклатураПокупателя.УникальныйИдентификатор()));
				НоменклатураПокупателя.Вставить("code", Выборка.НоменклатураПокупателяКод);
				НоменклатураПокупателя.Вставить("name", Выборка.НоменклатураПокупателяНаименование);
				НоменклатураПокупателя.Вставить("art", Выборка.НоменклатураПокупателяАртикул);
				НоменклатураПокупателя.Вставить("barcode", Выборка.НоменклатураПокупателяИдентификатор);
							
				Структура.Вставить("customer", 	НоменклатураПокупателя);
			КонецЕсли;
			
			МассивЗаказов.Добавить(Структура);
		КонецЦикла;
	КонецЕсли;
	
	ИсходящаяСтруктура.Вставить("items", МассивЗаказов);	
	ЗаписатьJSON(ЗаписьJSON, ИсходящаяСтруктура, Новый НастройкиСериализацииJSON, "ФункцияПреобразованияЗаписи");
	
	Возврат ЗаписьJSON.Закрыть();
КонецФункции

Функция ПолучитьЗаказWildberriesСтрокой(id)Экспорт 
	
	id = 	Лев(id, 8) + "-" + 
			Сред(id, 9, 4) + "-" + 
			Сред(id, 13, 4) + "-" + 
			Сред(id, 17, 4) + "-" + 
			Прав(id, 12);
	
	ИсходящаяСтруктура = Новый Структура;
	МассивЗаказов = Новый Массив;
		
	//ЗаказПокупателя = Документы.ЗаказПокупателя.ПолучитьСсылку(Новый УникальныйИдентификатор(id));
	ЗаказПокупателя = ЗаказПокупателяПоИдентификатору(id);
	ЗаказПокупателя = ЗаказПокупателя.ПолучитьОбъект();
	
	Если ЗаказПокупателя <> Неопределено Тогда 
				
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПокупателяТовары.НомерСтроки КАК НомерСтроки,
		|	ЗаказПокупателяТовары.Номенклатура.НаименованиеПолное КАК Наименование,
		|	ЗаказПокупателяТовары.Номенклатура КАК Номенклатура,
		|	ЗаказПокупателяТовары.Номенклатура.Код КАК Код,
		|	ЗаказПокупателяТовары.mega_НоменклатураПокупателя КАК НоменклатураПокупателя,
		|	ЗаказПокупателяТовары.mega_НоменклатураПокупателя.Наименование КАК НаименованиеПокупателя,
		|	ЗаказПокупателяТовары.mega_НоменклатураПокупателя.Артикул КАК АртикулПокупателя,
		|	ЗаказПокупателяТовары.mega_НоменклатураПокупателя.Идентификатор КАК Идентификатор,
		|	ЗаказПокупателяТовары.mega_НомерЗаказа КАК НомерДокумента,
		|	ЗаказПокупателяТовары.Номенклатура.Штрихкод КАК Штрихкод
		|ИЗ
		|	Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяТовары
		|ГДЕ
		|	ЗаказПокупателяТовары.Ссылка = &ЗаказПокупателя
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя.Ссылка);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		ЗаписьJSON 							= Новый ЗаписьJSON;
		ЗаписьJSON.ПроверятьСтруктуру 		= Истина;
		ПараметрыЗаписиJSON 				= Новый ПараметрыЗаписиJSON(, Символы.Таб);
		ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
		
		
		ИсходящаяСтруктура.Вставить("head", Новый Структура("id,number,date", 
										Строка(ЗаказПокупателя.Ссылка.УникальныйИдентификатор()), 
										ЗаказПокупателя.Номер, 
										Формат(ЗаказПокупателя.Дата, "ДФ=yyyyMMddHHmmss")));

		Пока Выборка.Следующий() Цикл
			
			Если Не ЗначениеЗаполнено(Выборка.Номенклатура) Тогда 
				
				Продолжить;
			КонецЕсли;
									
			Структура = Новый Структура;
			Структура.Вставить("index", 	Выборка.НомерСтроки);
			Структура.Вставить("name1", 	СокрЛП(Лев(Выборка.Наименование, 150)));
			Структура.Вставить("id", 		Строка(Выборка.Номенклатура.УникальныйИдентификатор()));
			Структура.Вставить("code", 		СокрЛП(Выборка.Код));
			Структура.Вставить("number", 	СокрЛП(Выборка.НомерДокумента));
			
			Структура.Вставить("name2", 	СокрЛП(Лев(Выборка.НаименованиеПокупателя, 150)));
			Структура.Вставить("art", 		СокрЛП(Выборка.АртикулПокупателя));
			Структура.Вставить("barcode", 	СокрЛП(Выборка.Идентификатор));
			Если Не ЗначениеЗаполнено(Выборка.НоменклатураПокупателя) Тогда 
				
				ВыборкаНоменклатураПоставщика = Справочники.НоменклатураПоставщиков.НоменклатураПоставщика(ЗаказПокупателя.Контрагент, Выборка.Номенклатура);
				Если ВыборкаНоменклатураПоставщика.Следующий() Тогда 
					
					НоменклатураПоставщика = ВыборкаНоменклатураПоставщика.Ссылка;
					
					Структура.Вставить("name2", 	СокрЛП(НоменклатураПоставщика.Наименование));
					Структура.Вставить("art", 		СокрЛП(НоменклатураПоставщика.Артикул));
					
					barcode = СокрЛП(НоменклатураПоставщика.Идентификатор);
					Если barcode = "" Тогда 
						barcode = РегистрыСведений.ШтрихкодыНоменклатуры.ПолучитьШтрихкодПоНоменклатуре(Выборка.Номенклатура);
					КонецЕсли;
					Структура.Вставить("barcode", 	barcode);
				КонецЕсли;
			КонецЕсли;                                       
			Если Структура.barcode = "" Тогда 
				Структура.barcode = РегистрыСведений.ШтрихкодыНоменклатуры.ПолучитьШтрихкодПоНоменклатуре(Выборка.Номенклатура);
			КонецЕсли;
			
			
			МассивЗаказов.Добавить(Структура);
		КонецЦикла;
	КонецЕсли;
	
	ИсходящаяСтруктура.Вставить("items", МассивЗаказов);
	ЗаписатьJSON(ЗаписьJSON, ИсходящаяСтруктура);
	
	Возврат ЗаписьJSON.Закрыть();
КонецФункции

Функция ПолучитьЗаказOzonСтрокой(id)Экспорт 
	
	id = 	Лев(id, 8) + "-" + 
			Сред(id, 9, 4) + "-" + 
			Сред(id, 13, 4) + "-" + 
			Сред(id, 17, 4) + "-" + 
			Прав(id, 12);
	
	ИсходящаяСтруктура = Новый Структура;
	МассивЗаказов = Новый Массив;
			
	ЗаказПокупателя = ЗаказПокупателяПоИдентификатору(id);
	ЗаказПокупателя = ЗаказПокупателя.ПолучитьОбъект();
	
	Если ЗаказПокупателя <> Неопределено Тогда 
				
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПокупателяТовары.НомерСтроки КАК НомерСтроки,
		|	ЗаказПокупателяТовары.Номенклатура.Наименование КАК Наименование,
		|	ЗаказПокупателяТовары.Номенклатура.Штрихкод КАК Штрихкод,
		|	ЗаказПокупателяТовары.Номенклатура КАК Номенклатура,
		|	ЗаказПокупателяТовары.Номенклатура.Код КАК Код,
		|	ЗаказПокупателяТовары.Номенклатура.Артикул КАК Артикул,
		|	ЗаказПокупателяТовары.mega_НомерЗаказа КАК НомерДокумента
		|ИЗ
		|	Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяТовары
		|ГДЕ
		|	ЗаказПокупателяТовары.Ссылка = &ЗаказПокупателя
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя.Ссылка);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		ЗаписьJSON 							= Новый ЗаписьJSON;
		ЗаписьJSON.ПроверятьСтруктуру 		= Истина;
		ПараметрыЗаписиJSON 				= Новый ПараметрыЗаписиJSON(, Символы.Таб);
		ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
		
		
		ИсходящаяСтруктура.Вставить("head", Новый Структура("id,number,date", 
										Строка(ЗаказПокупателя.Ссылка.УникальныйИдентификатор()), 
										ЗаказПокупателя.Номер, 
										Формат(ЗаказПокупателя.Дата, "ДФ=yyyyMMddHHmmss")));

		Пока Выборка.Следующий() Цикл
			
			Если Не ЗначениеЗаполнено(Выборка.Номенклатура) Тогда 
				
				Продолжить;
			КонецЕсли;
						
			Структура = Новый Структура;
			Структура.Вставить("index", 	Выборка.НомерСтроки);
			Структура.Вставить("name", 		СокрЛП(Лев(Выборка.Наименование, 150)));
			Структура.Вставить("id", 		Строка(Выборка.Номенклатура.УникальныйИдентификатор()));
			Структура.Вставить("code", 		СокрЛП(Выборка.Код));
			Структура.Вставить("art", 		СокрЛП(Выборка.Артикул));
			Структура.Вставить("number", 	СокрЛП(Выборка.НомерДокумента));
			Структура.Вставить("barcode", 	СокрЛП(Выборка.Штрихкод));
							
			
			МассивЗаказов.Добавить(Структура);
		КонецЦикла;
	КонецЕсли;
	
	ИсходящаяСтруктура.Вставить("items", МассивЗаказов);
	ЗаписатьJSON(ЗаписьJSON, ИсходящаяСтруктура);
	
	Возврат ЗаписьJSON.Закрыть();
КонецФункции

Функция ИзменитьЗаказПокупателяПослеОтчетаОСборке(ВходящаяСтрока)Экспорт 
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ВходящаяСтрока);
	ВходящаяСтруктура = ПрочитатьJSON(ЧтениеJSON, Ложь);
	
	ЗаказПокупателя = Документы.ЗаказПокупателя.ПолучитьСсылку(Новый УникальныйИдентификатор(ВходящаяСтруктура.id));
	ЗаказПокупателя = ЗаказПокупателя.ПолучитьОбъект();
	
	Если ЗаказПокупателя <> Неопределено Тогда
		
		Если ВходящаяСтруктура.items.Количество() <> ЗаказПокупателя.Запасы.Количество() Тогда 
			
			Возврат Ложь;
		КонецЕсли;
		
		БылиОшибки = Ложь;
		НачатьТранзакцию();
		
		//Корректируем текущий заказ
		Для Каждого ТекСтрока Из ВходящаяСтруктура.items Цикл 
			
			СтрокаДокумента = ЗаказПокупателя.Запасы[ТекСтрока.item - 1];
			СтрокаДокумента.mega_Собран = ТекСтрока.flag;
						
		КонецЦикла;
		
		//Попытка
		//	ЗаказПокупателя.Записать(РежимЗаписиДокумента.Проведение);
		//Исключение
		//	
		//	ЗаписьЖурналаРегистрации("devideorder",,, "devideorder " + Строка(ЗаказПокупателя), ОписаниеОшибки());
		//	
		//	ОтменитьТранзакцию();
		//	Возврат Ложь;
		//КонецПопытки;
		
		//Создаем копию текущего заказа
		НовыйЗаказПокупателя = ЗаказПокупателя.Скопировать();
		НовыйЗаказПокупателя.Номер = "";
		НовыйЗаказПокупателя.Дата = ЗаказПокупателя.Дата;
		
		НовыйЗаказПокупателя.Комментарий = "### Не собранный товар по " + Строка(ЗаказПокупателя);
		
		
		//Удаляем не собранные строки из текущего 
		
		БылоУдаление = Ложь;
		НомерСтроки = ЗаказПокупателя.Запасы.Количество() - 1;
		Пока НомерСтроки >= 0 Цикл 
			
			Если НЕ ЗаказПокупателя.Запасы[НомерСтроки].mega_Собран Тогда 
				
				ЗаказПокупателя.Запасы.Удалить(НомерСтроки);
				БылоУдаление = Истина;
			КонецЕсли;
			
			НомерСтроки = НомерСтроки - 1;
		КонецЦикла;
		
		
		
		Попытка			
			ЗаказПокупателя.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
				
			БылиОшибки = Истина;
			ЗаписьЖурналаРегистрации("devideorder",,, "devideorder " + Строка(ЗаказПокупателя), ОписаниеОшибки());					
		КонецПопытки;           
				
		
		//Удаляем собранные строки из копии текущего
		НомерСтроки = НовыйЗаказПокупателя.Запасы.Количество() - 1;
		Пока НомерСтроки >= 0 Цикл 
			
			Если НовыйЗаказПокупателя.Запасы[НомерСтроки].mega_Собран Тогда 
				
				НовыйЗаказПокупателя.Запасы.Удалить(НомерСтроки);
			КонецЕсли;
			
			НомерСтроки = НомерСтроки - 1;
		КонецЦикла;
		
		Если НовыйЗаказПокупателя.Запасы.Количество() > 0 Тогда 
			
			Попытка
				НовыйЗаказПокупателя.Записать(РежимЗаписиДокумента.Запись);
			Исключение								
				
				БылиОшибки = Истина;
				ЗаписьЖурналаРегистрации("devideorder",,, "devideorder " + Строка(НовыйЗаказПокупателя), ОписаниеОшибки());										
			КонецПопытки;			
		КонецЕсли;
		
		Если БылиОшибки Тогда 
			ОтменитьТранзакцию();
			
			Возврат Ложь;
		Иначе 
			
			ЗафиксироватьТранзакцию();			
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

Функция ИзменитьЗаказПокупателяПослеОтчетаОСборкеОпт(ВходящаяСтрока)Экспорт 
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ВходящаяСтрока);
	ВходящаяСтруктура = ПрочитатьJSON(ЧтениеJSON, Ложь);
	
	ЗаказПокупателя = Документы.ЗаказПокупателя.ПолучитьСсылку(Новый УникальныйИдентификатор(ВходящаяСтруктура.id));
	ЗаказПокупателя = ЗаказПокупателя.ПолучитьОбъект();
	
	Если ЗаказПокупателя <> Неопределено Тогда
		
		Если ВходящаяСтруктура.items.Количество() <> ЗаказПокупателя.Запасы.Количество() Тогда 
			
			Возврат Ложь;
		КонецЕсли;
		
		БылиОшибки = Ложь;
		НачатьТранзакцию();
		
		//Создаем копию текущего заказа
		НовыйЗаказПокупателя = ЗаказПокупателя.Скопировать();
		НовыйЗаказПокупателя.Номер = "";
		НовыйЗаказПокупателя.Дата = ЗаказПокупателя.Дата;
		НовыйЗаказПокупателя.Запасы.Очистить();		
		НовыйЗаказПокупателя.Комментарий = "### Не собранный товар по " + Строка(ЗаказПокупателя);
		
		//Корректируем текущий заказ и его копию
		Для Каждого ТекСтрока Из ВходящаяСтруктура.items Цикл 
			
			СтрокаЗаказПокупателя = ЗаказПокупателя.Запасы[ТекСтрока.item - 1];
			Если ТекСтрока.flag Тогда 				
				
				СтрокаЗаказПокупателя.mega_Собран = ТекСтрока.flag;
				Продолжить;
			КонецЕсли;
			
			СтрокаНовогоЗаказПокупателя = НовыйЗаказПокупателя.Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНовогоЗаказПокупателя, СтрокаЗаказПокупателя);
			
			//Если что-нибудь собрали
			Если ТекСтрока.collected > 0 Тогда 
				
				ПараметрыРасчета = Новый Структура;
				ПараметрыРасчета.Вставить("СброситьФлагСкидкиРассчитаны", Истина);
				ПараметрыРасчета.Вставить("СуммаВключаетНДС", ЗаказПокупателя.СуммаВключаетНДС);
				ПараметрыРасчета.Вставить("ИспользоватьМинимальныеЦены", Ложь);
				
				СтрокаЗаказПокупателя.Количество = ТекСтрока.collected;
				СтрокаЗаказПокупателя.mega_Собран = Истина;
				ТабличныеЧастиУНФКлиентСервер.РассчитатьСуммыВСтрокеТЧ(СтрокаЗаказПокупателя, ПараметрыРасчета);
			КонецЕсли;
			
			Если ТекСтрока.collected < СтрокаНовогоЗаказПокупателя.Количество Тогда
				
				ПараметрыРасчета = Новый Структура;
				ПараметрыРасчета.Вставить("СброситьФлагСкидкиРассчитаны", Истина);
				ПараметрыРасчета.Вставить("СуммаВключаетНДС", НовыйЗаказПокупателя.СуммаВключаетНДС);
				ПараметрыРасчета.Вставить("ИспользоватьМинимальныеЦены", Ложь);
				
				СтрокаНовогоЗаказПокупателя.Количество = СтрокаНовогоЗаказПокупателя.Количество - ТекСтрока.collected;			
				ТабличныеЧастиУНФКлиентСервер.РассчитатьСуммыВСтрокеТЧ(СтрокаНовогоЗаказПокупателя, ПараметрыРасчета);
			КонецЕсли;
						
		КонецЦикла;
				
		Попытка			
			ЗаказПокупателя.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
				
			БылиОшибки = Истина;
			ЗаписьЖурналаРегистрации("devideorder",,, "devideorder " + Строка(ЗаказПокупателя), ОписаниеОшибки());					
		КонецПопытки;           
								
		Если НовыйЗаказПокупателя.Запасы.Количество() > 0 Тогда 
			
			Попытка
				НовыйЗаказПокупателя.Записать(РежимЗаписиДокумента.Запись);
			Исключение								
				
				БылиОшибки = Истина;
				ЗаписьЖурналаРегистрации("devideorder",,, "devideorder " + Строка(НовыйЗаказПокупателя), ОписаниеОшибки());										
			КонецПопытки;			
		КонецЕсли;
		
		Если БылиОшибки Тогда 
			ОтменитьТранзакцию();
			
			Возврат Ложь;
		Иначе 
			
			ЗафиксироватьТранзакцию();			
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПокупателя(Контрагент)
	Покупатель = Новый Структура;
	Покупатель.Вставить("id", Строка(Контрагент.УникальныйИдентификатор()));
	Покупатель.Вставить("code", Строка(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "Код")));
	Покупатель.Вставить("name", Строка(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "Наименование"))); 
	Возврат Покупатель;
КонецФункции

Функция ЗаказПокупателяПоИдентификатору(id) 
	
	УникальныйИдентификатор = Новый УникальныйИдентификатор(id);
	Возврат Документы.ЗаказПокупателя.ПолучитьСсылку(УникальныйИдентификатор);
КонецФункции

Функция ПолучитьНоменклатуруПокупателя(Покупатель, Номенклатура)
	
	ВыборкаНоменклатурыПоставщика = Справочники.НоменклатураПоставщиков.НоменклатураПоставщика(Покупатель, Номенклатура);
	Если ВыборкаНоменклатурыПоставщика.Следующий() Тогда 
		
		ДанныеНоменклатурыПоставщика = Справочники.НоменклатураПоставщиков.ДанныеНоменклатурыПоставщика(ВыборкаНоменклатурыПоставщика.Ссылка);
		Структура = Новый Структура();
		Структура.Вставить("Код", ДанныеНоменклатурыПоставщика.Код);
		Структура.Вставить("Наименование", ДанныеНоменклатурыПоставщика.Наименование);
		Структура.Вставить("Идентификатор", ДанныеНоменклатурыПоставщика.Код);
		Структура.Вставить("Артикул", ДанныеНоменклатурыПоставщика.Артикул);
		Возврат Структура;
	КонецЕсли;	
	Возврат Неопределено;
КонецФункции

Функция МассивФБО(СписокФБО)
	
	ФБО = Новый Массив;
	
	Для Каждого ЭлементСпискаФБО из СписокФБО Цикл 
		ФБО.Добавить(ЭлементСпискаФБО.Ключ);
	КонецЦикла;
	
	Возврат ФБО;
КонецФункции

Функция СписокФБО()
	
	ФБО = Новый Соответствие;
	
	Вайлдберриз = Справочники.Контрагенты.НайтиПоКоду("УТ0004010");
	Если ЗначениеЗаполнено(Вайлдберриз) Тогда 
		
		ФБО.Вставить(Вайлдберриз, "wb");
	КонецЕсли;
	
	
	Озон = Справочники.Контрагенты.НайтиПоКоду("УТ0004009");
	Если ЗначениеЗаполнено(Вайлдберриз) Тогда 
		
		ФБО.Вставить(Озон, "ozon");
	КонецЕсли;
	
	test = Справочники.Контрагенты.НайтиПоКоду("НФ-000002");
	Если ЗначениеЗаполнено(test) Тогда 
		
		ФБО.Вставить(test, "test");
	КонецЕсли;
	
	Возврат ФБО;
КонецФункции

#КонецОбласти

#КонецЕсли
